app/controllers/locals_controller.rb

  def index
    @locals = Local.all
---
SELECT `locals`.* FROM `locals`

  def create
    @local = Local.new(local_params)

    if @local.save
---
INSERT INTO `locals` (`usuario_a_id`, `nombre`, `foto`, `calificacion`, `descripcion`, `direccion`, `created_at`, `updated_at`) VALUES (1, 'DelMaipo', '/dana/imagenes/7.png', 5.0, 'descripcion de prueba 1', 'Neltume 1775', '2016-10-28 19:27:52', '2016-10-28 19:27:52')