app/controllers/salas_controller.rb

SELECT `salas`.* FROM `salas` ORDER BY `salas`.`valor` ASC
---
  def index
    @temp = Sala.all()
    @salas = @temp.order(:valor)